In [1]:
import pandas as pd
import numpy as np
import warnings 
warnings.filterwarnings('ignore')

import matplotlib.pyplot as plt
plt.style.use('ggplot')
import seaborn as plt

In [2]:
data = pd.read_csv('bre.csv')
data.head(3)

,SALES_ID,SALES_REP,EMAILS,BRANDS,PLANT_COST,UNIT_PRICE,QUANTITY,COST,PROFIT,COUNTRIES,REGION,MONTHS,YEARS
0,10101,Jardine,jard@gmail.com,trophy,150,200,725,145000,36250,Ghana,Southeast,January,2019
1,10102,Gill,gillhell@uk.com,budweiser,250,500,815,407500,203750,Nigeria,west,February,2018
2,10103,Sorvino,sorvi2000@gmail.com,castle lite,180,450,937,421650,252990,Togo,southsouth,March,2018

# Countries Analysis

### 1. Country with the highest consumption of beer.

In [5]:
rm_malt1 = data.drop(data.index[data['BRANDS'] == 'beta malt'])
beer_only = data.drop(data.index[data['BRANDS'] == 'grand malt'])
beer_only.groupby(['COUNTRIES'])['QUANTITY'].sum().reset_index().sort_values(by = "QUANTITY")

  COUNTRIES  QUANTITY
4      Togo    150295
0     Benin    151357
1     Ghana    152640
2   Nigeria    154641
3   Senegal    155500

The country with the highest beer consumption appears to be Senegal

### 2. Highest sales personnel of Budweiser in Senegal

In [9]:
senegal = data[data['COUNTRIES'] == 'Senegal']
sen_bud = senegal[senegal['BRANDS'] == 'budweiser']

sen_bud.groupby(['SALES_REP'])['QUANTITY'].sum().reset_index().sort_values(by = 'QUANTITY')

   SALES_REP  QUANTITY
10  Thompson       729
6     Morgan       942
2     Howard       952
1       Gill       966
8      Smith      1673
7     Parent      1842
3    Jardine      2507
5     Kivell      2813
0    Andrews      3336
9    Sorvino      4246
4      Jones      5917

The Highest sales personnel of budweiser is Jones

### 3. Country with the highest profit of the fourth quarter in 2019

In [12]:
data_2019 = data[data['YEARS'] == 2019]
oct_19 = data_2019[data_2019['MONTHS'] == 'October']
nov_19 = data_2019[data_2019['MONTHS'] == 'Novemeber']
dec_19 = data_2019[data_2019['MONTHS'] == 'December']

fourth_quarter = pd.concat([oct_19, nov_19, dec_19], axis = 0)
fourth_quarter.groupby(['COUNTRIES'])['PROFIT'].sum().reset_index().sort_values(by = 'PROFIT')

  COUNTRIES   PROFIT
3   Senegal   477420
0     Benin   866550
2   Nigeria   925550
4      Togo   995720
1     Ghana  1004410

The Country with the highest profit of the fourth quarter in 2019 appears to be Ghana